// Структура данных одного дня:
// [День{ date, excercises: [Упражнение{reps: [Подход]}] }]

export let INITIAL_DATA = {
  daysList: [1, 2],
  days: {
    1: {
      date: "2016-05-08",
      excercises: [1]
    },
    2: {
      date: "2016-04-06",
      excercises: [2, 3]
    }
  },
  excercises: {
    1: {
      name: "Эллипс 1",
      type: "mins",
      reps: [
        {
          n: 5
        }
      ]
    },
    2: {
      name: "Эллипс 2",
      type: "mins",
      reps: [
        {
          n: 5
        }
      ]
    },
    3: {
      name: "Пресс",
      reps: [
        { n: 20 },
        { n: 20 },
        { n: 20 },
      ]
    }
  }
};
//         {
//           name: "Подъем ног",
//           reps: [
//             { n: 15 },
//             { n: 15 },
//             { n: 15 },
//           ]
//         },
//         {
//           name: "Спина-дельта",
//           reps: [
//             {
//               n: 15,
//               weight: 40
//             },
//             {
//               n: 15,
//               weight: 40
//             },
//             {
//               n: 15,
//               weight: 40
//             },
//           ]
//         },
//         {
//           name: "Спина-наклоны назад",
//           reps: [
//             {
//               n: 15,
//               weight: 50
//             },
//             {
//               n: 15,
//               weight: 50
//             },
//             {
//               n: 15,
//               weight: 50
//             },
//           ]
//         },
//         {
//           name: "Колени разгиб",
//           reps: [
//             {
//               n: 20,
//               weight: 20
//             },
//             {
//               n: 20,
//               weight: 20
//             },
//             {
//               n: 20,
//               weight: 20
//             },
//             {
//               n: 20,
//               weight: 20
//             },
//             {
//               n: 20,
//               weight: 20
//             },
//           ],
//         },
//         {
//           name: "Колени сгибания",
//           reps: [
//             {
//               n: 15,
//               weight: 50,
//             },
//             {
//               n: 15,
//               weight: 50,
//             },
//             {
//               n: 15,
//               weight: 50,
//             },
//           ]
//         },
//         {
//           name: "Грудные мышцы",
//           reps: [
//             {
//               n: 15,
//               weight: 40.5,
//             },
//             {
//               n: 15,
//               weight: 40.5,
//             },
//             {
//               n: 15,
//               weight: 40.5,
//             },
//           ]
//         },
//         {
//           name: "Трицепц",
//           reps: [
//             {
//               n: 15,
//               weight: 29,
//             },
//             {
//               n: 15,
//               weight: 29,
//             },
//             {
//               n: 15,
//               weight: 29,
//             },
//           ]
//         },
//         {
//           name: "Бицепц",
//           reps: [
//             {
//               n: 10,
//               weight: 10,
//             },
//             {
//               n: 10,
//               weight: 10,
//             },
//             {
//               n: 10,
//               weight: 10,
//             },
//           ]
//         },
//         {
//           name: "Эллипс",
//           type: "mins",
//           reps: [
//             {
//               n: 5,
//             }
//           ]
//         }
//       ]
//     }
//   ]
// };
